publish/solutionnaireAncienFinal.html
<?xml version="1.0" encoding="utf-8"?>
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-08 Sun 03:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>solutionnaireAncienFinal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="frederic boileau" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">solutionnaireAncienFinal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2d29382">1. final 2014</a>
<ul>
<li><a href="#org4293372">1.1. echauffement (14 points)</a></li>
<li><a href="#org3d0d18e">1.2. que produit ce code</a></li>
<li><a href="#org0788727">1.3. -Boucles simples (a) (6 points)</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org2d29382" class="outline-2">
<h2 id="org2d29382"><span class="section-number-2">1</span> final 2014</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4293372" class="outline-3">
<h3 id="org4293372"><span class="section-number-3">1.1</span> echauffement (14 points)</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">a</span>=<span style="color: #B58DAE; font-weight: bold;">1</span>,<span style="color: #dac6d6;">b</span>=<span style="color: #B58DAE; font-weight: bold;">3</span>;
console.log<span style="color: #80A0C2;">(</span><span style="color: #B58DAE;">(</span>a+b<span style="color: #B58DAE;">)</span>+<span style="color: #A2BF8A;">"+"</span>+b+a ,<span style="color: #A2BF8A;">"="</span>,<span style="color: #B58DAE; font-weight: bold;">2</span>*<span style="color: #B58DAE;">(</span>a+b<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">a</span>=<span style="color: #B58DAE; font-weight: bold;">1</span>,<span style="color: #dac6d6;">b</span>=<span style="color: #B58DAE; font-weight: bold;">3</span>;
console.log<span style="color: #80A0C2;">(</span>a/b<span style="color: #80A0C2;">)</span>;
</pre>
</div>


<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">a</span>=<span style="color: #B58DAE; font-weight: bold;">1</span>,<span style="color: #dac6d6;">b</span>=<span style="color: #B58DAE; font-weight: bold;">3</span>;
console.log<span style="color: #80A0C2;">(</span>a-b+<span style="color: #B58DAE; font-weight: bold;">1</span>-b*a<span style="color: #80A0C2;">)</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">a</span>=<span style="color: #B58DAE; font-weight: bold;">1</span>,<span style="color: #dac6d6;">b</span>=<span style="color: #B58DAE; font-weight: bold;">3</span>;
console.log<span style="color: #80A0C2;">(</span><span style="color: #B58DAE;">(</span>Math.random<span style="color: #A2BF8A;">()</span> === <span style="color: #B58DAE; font-weight: bold;">1</span><span style="color: #B58DAE;">)</span>? <span style="color: #B58DAE;">true</span>:<span style="color: #B58DAE;">false</span><span style="color: #80A0C2;">)</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">a</span>=<span style="color: #B58DAE; font-weight: bold;">1</span>,<span style="color: #dac6d6;">b</span>=<span style="color: #B58DAE; font-weight: bold;">3</span>;
console.log<span style="color: #80A0C2;">(</span><span style="color: #B58DAE;">[</span>a,<span style="color: #A2BF8A;">"b"</span>,b<span style="color: #B58DAE;">]</span><span style="color: #80A0C2;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org3d0d18e" class="outline-3">
<h3 id="org3d0d18e"><span class="section-number-3">1.2</span> que produit ce code</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">var</span> <span style="color: #dac6d6;">t</span> = <span style="color: #80A0C2;">[</span><span style="color: #B58DAE; font-weight: bold;">1</span>,<span style="color: #B58DAE; font-weight: bold;">2</span>,<span style="color: #B58DAE; font-weight: bold;">3</span><span style="color: #80A0C2;">]</span>;
<span style="color: #80A0C2;">var</span> <span style="color: #dac6d6;">r</span> = <span style="color: #80A0C2;">[</span><span style="color: #B58DAE; font-weight: bold;">5</span>,<span style="color: #B58DAE; font-weight: bold;">6</span>,<span style="color: #B58DAE; font-weight: bold;">7</span><span style="color: #80A0C2;">]</span>;
<span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">quiz</span> = <span style="color: #80A0C2;">function</span><span style="color: #80A0C2;">(</span><span style="color: #dac6d6;">r</span>,<span style="color: #dac6d6;">t</span><span style="color: #80A0C2;">)</span> <span style="color: #80A0C2;">{</span>
    r = t;
    t<span style="color: #B58DAE;">[</span><span style="color: #B58DAE; font-weight: bold;">1</span><span style="color: #B58DAE;">]</span> = r<span style="color: #B58DAE;">[</span><span style="color: #B58DAE; font-weight: bold;">2</span><span style="color: #B58DAE;">]</span>;
    console.log<span style="color: #B58DAE;">(</span>t<span style="color: #B58DAE;">)</span>;
    <span style="color: #80A0C2;">return</span> r;
<span style="color: #80A0C2;">}</span>;
console.log<span style="color: #80A0C2;">(</span>quiz<span style="color: #B58DAE;">(</span>f,q<span style="color: #B58DAE;">)</span><span style="color: #80A0C2;">)</span>;
</pre>
</div>

<pre class="example">
[ 1, 2, 3 ]
[ 'a', 'c', 'c' ]
t= [ 1, 2, 3 ] r= [ 'a', 5, 'c' ] s= [ 'a', 5, 'c' ]
undefined
</pre>
</div>
</div>

<div id="outline-container-org0788727" class="outline-3">
<h3 id="org0788727"><span class="section-number-3">1.3</span> -Boucles simples (a) (6 points)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Écrire une fonction loop qui tire aléatoirement des nombres entiers entre O et
10 0 (inclus).
Les tirages s&rsquo;arrêtent lorsque la valeur 0 est tirée;
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">gen</span> = <span style="color: #80A0C2;">function</span><span style="color: #80A0C2;">(</span><span style="color: #dac6d6;">range</span><span style="color: #80A0C2;">){</span><span style="color: #80A0C2;">return</span> Math.floor<span style="color: #B58DAE;">(</span><span style="color: #A2BF8A;">(</span>range*Math.random<span style="color: #80A0C2;">()</span><span style="color: #A2BF8A;">)</span><span style="color: #B58DAE;">)</span>;<span style="color: #80A0C2;">}</span>;
<span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">x</span> = gen<span style="color: #80A0C2;">(</span><span style="color: #B58DAE; font-weight: bold;">10</span><span style="color: #80A0C2;">)</span>;
<span style="color: #80A0C2;">var</span> <span style="color: #dac6d6;">tableau</span> = <span style="color: #80A0C2;">[</span>x<span style="color: #80A0C2;">]</span>;
<span style="color: #80A0C2;">while</span> <span style="color: #80A0C2;">(</span>x != <span style="color: #B58DAE; font-weight: bold;">0</span><span style="color: #80A0C2;">){</span>
    x = gen<span style="color: #B58DAE;">(</span><span style="color: #B58DAE; font-weight: bold;">10</span><span style="color: #B58DAE;">)</span>;
    tableau.push<span style="color: #B58DAE;">(</span>x<span style="color: #B58DAE;">)</span>;
<span style="color: #80A0C2;">}</span>;
console.log<span style="color: #80A0C2;">(</span>tableau<span style="color: #80A0C2;">)</span>;
<span style="color: #80A0C2;">let</span> <span style="color: #dac6d6;">stats</span> <span style="color: #80A0C2;">function</span><span style="color: #80A0C2;">(</span><span style="color: #dac6d6;">tableau</span><span style="color: #80A0C2;">)</span> <span style="color: #80A0C2;">{</span>
   <span style="color: #6f7787;">// </span><span style="color: #6f7787;">le nombre de tirages non nuls r&#233;alis&#233;s,</span>


<span style="color: #80A0C2;">}</span>
</pre>
</div>


<p>
et la
fonction affiche selon lexemple donné ci-après:
• le nombre de tirages non nuls réalisés,
</p>

<p>
• le nombre d&rsquo;entiers pairs tirés (la valeur 0 n&rsquo;est pas comptée) et
le pourcentage que cela représente par rapport au nombre total de tirages non
nuls,
</p>


<p>
• la moyenne des entiers impairs. Pour les tirages successifs: 1 5 3 69 56 0,
l&rsquo;affichage suivant doit être produit: 5 tirages &gt;O, nbpairs: 1 (20.00%) moy
pairs: 56.00 moy impairs: 26.80
</p>

<div class="org-src-container">
<pre class="src src-js">
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: frederic boileau</p>
<p class="date">Created: 2019-12-08 Sun 03:17</p>
</div>
</body>
</html>
